apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_uart_m33_u3u5.h
/****************************************************************************
 * arch/arm/src/common/stm32/hardware/stm32_uart_m33_u3u5.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_COMMON_STM32_HARDWARE_STM32_UART_M33_U3U5_H
#define __ARCH_ARM_SRC_COMMON_STM32_HARDWARE_STM32_UART_M33_U3U5_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include "chip.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register Offsets *********************************************************/

#define STM32_USART_CR1_OFFSET      0x0000 /* USART control register 1 */
#define STM32_USART_CR2_OFFSET      0x0004 /* USART control register 2 */
#define STM32_USART_CR3_OFFSET      0x0008 /* USART control register 3 */
#define STM32_USART_BRR_OFFSET      0x000c /* USART baud-rate register */
#define STM32_USART_GTPR_OFFSET     0x0010 /* USART guard-time and prescaler register */
#define STM32_USART_RTOR_OFFSET     0x0014 /* USART receiver-timeout register */
#define STM32_USART_RQR_OFFSET      0x0018 /* USART request register */
#define STM32_USART_ISR_OFFSET      0x001c /* USART interrupt and status register */
#define STM32_USART_ICR_OFFSET      0x0020 /* USART interrupt flag clear register */
#define STM32_USART_RDR_OFFSET      0x0024 /* USART receive-data register */
#define STM32_USART_TDR_OFFSET      0x0028 /* USART transmit-data register */
#define STM32_USART_PRESC_OFFSET    0x002c /* USART prescaler register */
#define STM32_USART_AUTOCR_OFFSET   0x0030 /* USART autonomous-mode control register */

/* Register Addresses *******************************************************/

#if STM32_NLPUART > 0
#  define STM32_LPUART1_CR1           (STM32_LPUART1_BASE + STM32_USART_CR1_OFFSET)
#  define STM32_LPUART1_CR2           (STM32_LPUART1_BASE + STM32_USART_CR2_OFFSET)
#  define STM32_LPUART1_CR3           (STM32_LPUART1_BASE + STM32_USART_CR3_OFFSET)
#  define STM32_LPUART1_BRR           (STM32_LPUART1_BASE + STM32_USART_BRR_OFFSET)
#  define STM32_LPUART1_GTPR          (STM32_LPUART1_BASE + STM32_USART_GTPR_OFFSET)
#  define STM32_LPUART1_RTOR          (STM32_LPUART1_BASE + STM32_USART_RTOR_OFFSET)
#  define STM32_LPUART1_RQR           (STM32_LPUART1_BASE + STM32_USART_RQR_OFFSET)
#  define STM32_LPUART1_ISR           (STM32_LPUART1_BASE + STM32_USART_ISR_OFFSET)
#  define STM32_LPUART1_ICR           (STM32_LPUART1_BASE + STM32_USART_ICR_OFFSET)
#  define STM32_LPUART1_RDR           (STM32_LPUART1_BASE + STM32_USART_RDR_OFFSET)
#  define STM32_LPUART1_TDR           (STM32_LPUART1_BASE + STM32_USART_TDR_OFFSET)
#  define STM32_LPUART1_PRESC         (STM32_LPUART1_BASE + STM32_USART_PRESC_OFFSET)
#  define STM32_LPUART1_AUTOCR        (STM32_LPUART1_BASE + STM32_USART_AUTOCR_OFFSET)
#endif

#if STM32_NUSART > 0
#  define STM32_USART1_CR1            (STM32_USART1_BASE + STM32_USART_CR1_OFFSET)
#  define STM32_USART1_CR2            (STM32_USART1_BASE + STM32_USART_CR2_OFFSET)
#  define STM32_USART1_CR3            (STM32_USART1_BASE + STM32_USART_CR3_OFFSET)
#  define STM32_USART1_BRR            (STM32_USART1_BASE + STM32_USART_BRR_OFFSET)
#  define STM32_USART1_GTPR           (STM32_USART1_BASE + STM32_USART_GTPR_OFFSET)
#  define STM32_USART1_RTOR           (STM32_USART1_BASE + STM32_USART_RTOR_OFFSET)
#  define STM32_USART1_RQR            (STM32_USART1_BASE + STM32_USART_RQR_OFFSET)
#  define STM32_USART1_ISR            (STM32_USART1_BASE + STM32_USART_ISR_OFFSET)
#  define STM32_USART1_ICR            (STM32_USART1_BASE + STM32_USART_ICR_OFFSET)
#  define STM32_USART1_RDR            (STM32_USART1_BASE + STM32_USART_RDR_OFFSET)
#  define STM32_USART1_TDR            (STM32_USART1_BASE + STM32_USART_TDR_OFFSET)
#  define STM32_USART1_PRESC          (STM32_USART1_BASE + STM32_USART_PRESC_OFFSET)
#  define STM32_USART1_AUTOCR         (STM32_USART1_BASE + STM32_USART_AUTOCR_OFFSET)
#endif

#if STM32_NUSART > 1
#  define STM32_USART2_CR1            (STM32_USART2_BASE + STM32_USART_CR1_OFFSET)
#  define STM32_USART2_CR2            (STM32_USART2_BASE + STM32_USART_CR2_OFFSET)
#  define STM32_USART2_CR3            (STM32_USART2_BASE + STM32_USART_CR3_OFFSET)
#  define STM32_USART2_BRR            (STM32_USART2_BASE + STM32_USART_BRR_OFFSET)
#  define STM32_USART2_GTPR           (STM32_USART2_BASE + STM32_USART_GTPR_OFFSET)
#  define STM32_USART2_RTOR           (STM32_USART2_BASE + STM32_USART_RTOR_OFFSET)
#  define STM32_USART2_RQR            (STM32_USART2_BASE + STM32_USART_RQR_OFFSET)
#  define STM32_USART2_ISR            (STM32_USART2_BASE + STM32_USART_ISR_OFFSET)
#  define STM32_USART2_ICR            (STM32_USART2_BASE + STM32_USART_ICR_OFFSET)
#  define STM32_USART2_RDR            (STM32_USART2_BASE + STM32_USART_RDR_OFFSET)
#  define STM32_USART2_TDR            (STM32_USART2_BASE + STM32_USART_TDR_OFFSET)
#  define STM32_USART2_PRESC          (STM32_USART2_BASE + STM32_USART_PRESC_OFFSET)
#  define STM32_USART2_AUTOCR         (STM32_USART2_BASE + STM32_USART_AUTOCR_OFFSET)
#endif

