apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_uart_m33_u3u5.h
#if STM32_NUSART > 2
#  define STM32_USART3_CR1            (STM32_USART3_BASE + STM32_USART_CR1_OFFSET)
#  define STM32_USART3_CR2            (STM32_USART3_BASE + STM32_USART_CR2_OFFSET)
#  define STM32_USART3_CR3            (STM32_USART3_BASE + STM32_USART_CR3_OFFSET)
#  define STM32_USART3_BRR            (STM32_USART3_BASE + STM32_USART_BRR_OFFSET)
#  define STM32_USART3_GTPR           (STM32_USART3_BASE + STM32_USART_GTPR_OFFSET)
#  define STM32_USART3_RTOR           (STM32_USART3_BASE + STM32_USART_RTOR_OFFSET)
#  define STM32_USART3_RQR            (STM32_USART3_BASE + STM32_USART_RQR_OFFSET)
#  define STM32_USART3_ISR            (STM32_USART3_BASE + STM32_USART_ISR_OFFSET)
#  define STM32_USART3_ICR            (STM32_USART3_BASE + STM32_USART_ICR_OFFSET)
#  define STM32_USART3_RDR            (STM32_USART3_BASE + STM32_USART_RDR_OFFSET)
#  define STM32_USART3_TDR            (STM32_USART3_BASE + STM32_USART_TDR_OFFSET)
#  define STM32_USART3_PRESC          (STM32_USART3_BASE + STM32_USART_PRESC_OFFSET)
#  define STM32_USART3_AUTOCR         (STM32_USART3_BASE + STM32_USART_AUTOCR_OFFSET)
#endif

#if STM32_NUART > 0
#  define STM32_UART4_CR1             (STM32_UART4_BASE + STM32_USART_CR1_OFFSET)
#  define STM32_UART4_CR2             (STM32_UART4_BASE + STM32_USART_CR2_OFFSET)
#  define STM32_UART4_CR3             (STM32_UART4_BASE + STM32_USART_CR3_OFFSET)
#  define STM32_UART4_BRR             (STM32_UART4_BASE + STM32_USART_BRR_OFFSET)
#  define STM32_UART4_GTPR            (STM32_UART4_BASE + STM32_USART_GTPR_OFFSET)
#  define STM32_UART4_RTOR            (STM32_UART4_BASE + STM32_USART_RTOR_OFFSET)
#  define STM32_UART4_RQR             (STM32_UART4_BASE + STM32_USART_RQR_OFFSET)
#  define STM32_UART4_ISR             (STM32_UART4_BASE + STM32_USART_ISR_OFFSET)
#  define STM32_UART4_ICR             (STM32_UART4_BASE + STM32_USART_ICR_OFFSET)
#  define STM32_UART4_RDR             (STM32_UART4_BASE + STM32_USART_RDR_OFFSET)
#  define STM32_UART4_TDR             (STM32_UART4_BASE + STM32_USART_TDR_OFFSET)
#  define STM32_UART4_PRESC           (STM32_UART4_BASE + STM32_USART_PRESC_OFFSET)
#  define STM32_UART4_AUTOCR          (STM32_UART4_BASE + STM32_USART_AUTOCR_OFFSET)
#endif

#if STM32_NUART > 1
#  define STM32_UART5_CR1             (STM32_UART5_BASE + STM32_USART_CR1_OFFSET)
#  define STM32_UART5_CR2             (STM32_UART5_BASE + STM32_USART_CR2_OFFSET)
#  define STM32_UART5_CR3             (STM32_UART5_BASE + STM32_USART_CR3_OFFSET)
#  define STM32_UART5_BRR             (STM32_UART5_BASE + STM32_USART_BRR_OFFSET)
#  define STM32_UART5_GTPR            (STM32_UART5_BASE + STM32_USART_GTPR_OFFSET)
#  define STM32_UART5_RTOR            (STM32_UART5_BASE + STM32_USART_RTOR_OFFSET)
#  define STM32_UART5_RQR             (STM32_UART5_BASE + STM32_USART_RQR_OFFSET)
#  define STM32_UART5_ISR             (STM32_UART5_BASE + STM32_USART_ISR_OFFSET)
#  define STM32_UART5_ICR             (STM32_UART5_BASE + STM32_USART_ICR_OFFSET)
#  define STM32_UART5_RDR             (STM32_UART5_BASE + STM32_USART_RDR_OFFSET)
#  define STM32_UART5_TDR             (STM32_UART5_BASE + STM32_USART_TDR_OFFSET)
#  define STM32_UART5_PRESC           (STM32_UART5_BASE + STM32_USART_PRESC_OFFSET)
#  define STM32_UART5_AUTOCR          (STM32_UART5_BASE + STM32_USART_AUTOCR_OFFSET)
#endif

/* Register Bitfield Definitions ********************************************/

/* USART control register 1 */

#define USART_CR1_UE                               (1 << 0)
#define USART_CR1_UESM                             (1 << 1)
#define USART_CR1_RE                               (1 << 2)
#define USART_CR1_TE                               (1 << 3)
#define USART_CR1_IDLEIE                           (1 << 4)
#define USART_CR1_RXNEIE                           (1 << 5)
#define USART_CR1_TCIE                             (1 << 6)
#define USART_CR1_TXEIE                            (1 << 7)
#define USART_CR1_TXEIE_TXFNFIE                    (1 << 7)
#define USART_CR1_PEIE                             (1 << 8)
#define USART_CR1_PS                               (1 << 9)
#define USART_CR1_PCE                              (1 << 10)
#define USART_CR1_WAKE                             (1 << 11)
#define USART_CR1_M_MASK                           0x10001000
#define USART_CR1_M0                               (1 << 12)
#define USART_CR1_MME                              (1 << 13)
#define USART_CR1_CMIE                             (1 << 14)
#define USART_CR1_OVER8                            (1 << 15)
#define USART_CR1_DEDT_SHIFT                       (16)
#define USART_CR1_DEDT_MASK                        (0x1f << USART_CR1_DEDT_SHIFT)
#define USART_CR1_DEDT(n)                          ((n) << USART_CR1_DEDT_SHIFT)
#define USART_CR1_DEAT_SHIFT                       (21)
#define USART_CR1_DEAT_MASK                        (0x1f << USART_CR1_DEAT_SHIFT)
#define USART_CR1_DEAT(n)                          ((n) << USART_CR1_DEAT_SHIFT)
#define USART_CR1_RTOIE                            (1 << 26)
#define USART_CR1_EOBIE                            (1 << 27)
#define USART_CR1_M1                               (1 << 28)
#define USART_CR1_FIFOEN                           (1 << 29)
#define USART_CR1_TXFEIE                           (1 << 30)
#define USART_CR1_RXFFIE                           (1 << 31)
#define USART_CR1_RXNEIE_RXFNEIE                   USART_CR1_RXNEIE
#define USART_CR1_ALLINTS                          (USART_CR1_IDLEIE | USART_CR1_RXNEIE | USART_CR1_TCIE | \
   USART_CR1_TXEIE | USART_CR1_PEIE | USART_CR1_CMIE | \
   USART_CR1_RTOIE | USART_CR1_EOBIE | USART_CR1_TXFEIE | \
   USART_CR1_RXFFIE)

/* USART control register 2 */

#define USART_CR2_SLVEN                            (1 << 0)
#define USART_CR2_DIS_NSS                          (1 << 3)
#define USART_CR2_ADDM7                            (1 << 4)
#define USART_CR2_LBDL                             (1 << 5)
#define USART_CR2_LBDIE                            (1 << 6)
#define USART_CR2_LBCL                             (1 << 8)
#define USART_CR2_CPHA                             (1 << 9)
#define USART_CR2_CPOL                             (1 << 10)
#define USART_CR2_CLKEN                            (1 << 11)
#define USART_CR2_STOP_SHIFT                       (12)
#define USART_CR2_STOP_MASK                        (0x3 << USART_CR2_STOP_SHIFT)
#define USART_CR2_STOP(n)                          ((n) << USART_CR2_STOP_SHIFT)
#define USART_CR2_LINEN                            (1 << 14)
#define USART_CR2_SWAP                             (1 << 15)
#define USART_CR2_RXINV                            (1 << 16)
#define USART_CR2_TXINV                            (1 << 17)
#define USART_CR2_DATAINV                          (1 << 18)
#define USART_CR2_MSBFIRST                         (1 << 19)
#define USART_CR2_ABREN                            (1 << 20)
#define USART_CR2_ABRMODE_SHIFT                    (21)
#define USART_CR2_ABRMODE_MASK                     (0x3 << USART_CR2_ABRMODE_SHIFT)
#define USART_CR2_ABRMODE(n)                       ((n) << USART_CR2_ABRMODE_SHIFT)
#define USART_CR2_RTOEN                            (1 << 23)
#define USART_CR2_ADD_SHIFT                        (24)
#define USART_CR2_ADD_MASK                         (0xff << USART_CR2_ADD_SHIFT)
#define USART_CR2_ADD(n)                           ((n) << USART_CR2_ADD_SHIFT)
#define USART_CR2_STOP1                            USART_CR2_STOP(0)
#define USART_CR2_STOP0p5                          USART_CR2_STOP(1)
#define USART_CR2_STOP2                            USART_CR2_STOP(2)
#define USART_CR2_STOP1p5                          USART_CR2_STOP(3)
#define USART_CR2_ABRMODE_START                    USART_CR2_ABRMODE(0)
#define USART_CR2_ABRMODE_EDGES                    USART_CR2_ABRMODE(1)
#define USART_CR2_ABRMODE_7F                       USART_CR2_ABRMODE(2)
#define USART_CR2_ABRMODE_55                       USART_CR2_ABRMODE(3)
#define USART_CR2_ABRMOD_SHIFT                     USART_CR2_ABRMODE_SHIFT
#define USART_CR2_ABRMOD_MASK                      USART_CR2_ABRMODE_MASK
#define USART_CR2_ABRMOD(n)                        USART_CR2_ABRMODE(n)
#define USART_CR2_ABRMOD_START                     USART_CR2_ABRMODE_START
#define USART_CR2_ABRMOD_EDGES                     USART_CR2_ABRMODE_EDGES
#define USART_CR2_ABRMOD_7F                        USART_CR2_ABRMODE_7F
#define USART_CR2_ABRMOD_55                        USART_CR2_ABRMODE_55

