apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_uart_m33_u3u5.h
/* USART control register 3 */

#define USART_CR3_EIE                              (1 << 0)
#define USART_CR3_IREN                             (1 << 1)
#define USART_CR3_IRLP                             (1 << 2)
#define USART_CR3_HDSEL                            (1 << 3)
#define USART_CR3_NACK                             (1 << 4)
#define USART_CR3_SCEN                             (1 << 5)
#define USART_CR3_DMAR                             (1 << 6)
#define USART_CR3_DMAT                             (1 << 7)
#define USART_CR3_RTSE                             (1 << 8)
#define USART_CR3_CTSE                             (1 << 9)
#define USART_CR3_CTSIE                            (1 << 10)
#define USART_CR3_ONEBIT                           (1 << 11)
#define USART_CR3_OVRDIS                           (1 << 12)
#define USART_CR3_DDRE                             (1 << 13)
#define USART_CR3_DEM                              (1 << 14)
#define USART_CR3_DEP                              (1 << 15)
#define USART_CR3_SCARCNT_SHIFT                    (17)
#define USART_CR3_SCARCNT_MASK                     (0x7 << USART_CR3_SCARCNT_SHIFT)
#define USART_CR3_SCARCNT(n)                       ((n) << USART_CR3_SCARCNT_SHIFT)
#define USART_CR3_TXFTIE                           (1 << 23)
#define USART_CR3_TCBGTIE                          (1 << 24)
#define USART_CR3_RXFTCFG_SHIFT                    (25)
#define USART_CR3_RXFTCFG_MASK                     (0x7 << USART_CR3_RXFTCFG_SHIFT)
#define USART_CR3_RXFTCFG(n)                       ((n) << USART_CR3_RXFTCFG_SHIFT)
#define USART_CR3_RXFTIE                           (1 << 28)
#define USART_CR3_TXFTCFG_SHIFT                    (29)
#define USART_CR3_TXFTCFG_MASK                     (0x7 << USART_CR3_TXFTCFG_SHIFT)
#define USART_CR3_TXFTCFG(n)                       ((n) << USART_CR3_TXFTCFG_SHIFT)
#define USART_CR3_SCARCNT2_SHIFT                   USART_CR3_SCARCNT_SHIFT
#define USART_CR3_SCARCNT2_MASK                    USART_CR3_SCARCNT_MASK
#define USART_CR3_RXFTCFG_1_8                      USART_CR3_RXFTCFG(0)
#define USART_CR3_RXFTCFG_1_4                      USART_CR3_RXFTCFG(1)
#define USART_CR3_RXFTCFG_1_2                      USART_CR3_RXFTCFG(2)
#define USART_CR3_RXFTCFG_3_4                      USART_CR3_RXFTCFG(3)
#define USART_CR3_RXFTCFG_7_8                      USART_CR3_RXFTCFG(4)
#define USART_CR3_RXFTCFG_FULL                     USART_CR3_RXFTCFG(5)
#define USART_CR3_TXFTCFG_1_8                      USART_CR3_TXFTCFG(0)
#define USART_CR3_TXFTCFG_1_4                      USART_CR3_TXFTCFG(1)
#define USART_CR3_TXFTCFG_1_2                      USART_CR3_TXFTCFG(2)
#define USART_CR3_TXFTCFG_3_4                      USART_CR3_TXFTCFG(3)
#define USART_CR3_TXFTCFG_7_8                      USART_CR3_TXFTCFG(4)
#define USART_CR3_TXFTCFG_FULL                     USART_CR3_TXFTCFG(5)

/* USART baud-rate register */

#define USART_BRR_LPUART_SHIFT                     (0)
#define USART_BRR_LPUART_MASK                      (0xfffff << USART_BRR_LPUART_SHIFT)
#define USART_BRR_LPUART(n)                        ((n) << USART_BRR_LPUART_SHIFT)
#define USART_BRR_BRR_SHIFT                        (0)
#define USART_BRR_BRR_MASK                         (0xffff << USART_BRR_BRR_SHIFT)
#define USART_BRR_BRR(n)                           ((n) << USART_BRR_BRR_SHIFT)
#define USART_BRR_FRAC_SHIFT                       (0)
#define USART_BRR_FRAC_MASK                        (0xf << USART_BRR_FRAC_SHIFT)
#define USART_BRR_MANT_SHIFT                       (4)
#define USART_BRR_MANT_MASK                        (0xfff << USART_BRR_MANT_SHIFT)

/* USART guard-time and prescaler register */

#define USART_GTPR_PSC_SHIFT                       (0)
#define USART_GTPR_PSC_MASK                        (0xff << USART_GTPR_PSC_SHIFT)
#define USART_GTPR_PSC(n)                          ((n) << USART_GTPR_PSC_SHIFT)
#define USART_GTPR_GT_SHIFT                        (8)
#define USART_GTPR_GT_MASK                         (0xff << USART_GTPR_GT_SHIFT)
#define USART_GTPR_GT(n)                           ((n) << USART_GTPR_GT_SHIFT)

/* USART receiver-timeout register */

#define USART_RTOR_RTO_SHIFT                       (0)
#define USART_RTOR_RTO_MASK                        (0xffffff << USART_RTOR_RTO_SHIFT)
#define USART_RTOR_RTO(n)                          ((n) << USART_RTOR_RTO_SHIFT)
#define USART_RTOR_BLEN_SHIFT                      (24)
#define USART_RTOR_BLEN_MASK                       (0xff << USART_RTOR_BLEN_SHIFT)
#define USART_RTOR_BLEN(n)                         ((n) << USART_RTOR_BLEN_SHIFT)

/* USART request register */

#define USART_RQR_ABRRQ                            (1 << 0)
#define USART_RQR_SBKRQ                            (1 << 1)
#define USART_RQR_MMRQ                             (1 << 2)
#define USART_RQR_RXFRQ                            (1 << 3)
#define USART_RQR_TXFRQ                            (1 << 4)

/* USART interrupt and status register */

#define USART_ISR_PE                               (1 << 0)
#define USART_ISR_FE                               (1 << 1)
#define USART_ISR_NE                               (1 << 2)
#define USART_ISR_ORE                              (1 << 3)
#define USART_ISR_IDLE                             (1 << 4)
#define USART_ISR_RXNE                             (1 << 5)
#define USART_ISR_TC                               (1 << 6)
#define USART_ISR_TXE                              (1 << 7)
#define USART_ISR_LBDF                             (1 << 8)
#define USART_ISR_CTSIF                            (1 << 9)
#define USART_ISR_CTS                              (1 << 10)
#define USART_ISR_RTOF                             (1 << 11)
#define USART_ISR_EOBF                             (1 << 12)
#define USART_ISR_UDR                              (1 << 13)
#define USART_ISR_ABRE                             (1 << 14)
#define USART_ISR_ABRF                             (1 << 15)
#define USART_ISR_BUSY                             (1 << 16)
#define USART_ISR_CMF                              (1 << 17)
#define USART_ISR_SBKF                             (1 << 18)
#define USART_ISR_RWU                              (1 << 19)
#define USART_ISR_TEACK                            (1 << 21)
#define USART_ISR_REACK                            (1 << 22)
#define USART_ISR_TXFE                             (1 << 23)
#define USART_ISR_RXFF                             (1 << 24)
#define USART_ISR_TCBGT                            (1 << 25)
#define USART_ISR_RXFT                             (1 << 26)
#define USART_ISR_TXFT                             (1 << 27)
#define USART_ISR_RXNE_RXFNE                       USART_ISR_RXNE
#define USART_ISR_TXE_TXFNF                        USART_ISR_TXE
#define USART_ISR_NF                               USART_ISR_NE
#define USART_ISR_LBD                              USART_ISR_LBDF

/* USART interrupt flag clear register */

#define USART_ICR_PECF                             (1 << 0)
#define USART_ICR_FECF                             (1 << 1)
#define USART_ICR_NECF                             (1 << 2)
#define USART_ICR_ORECF                            (1 << 3)
#define USART_ICR_IDLECF                           (1 << 4)
#define USART_ICR_TXFECF                           (1 << 5)
#define USART_ICR_TCCF                             (1 << 6)
#define USART_ICR_TCBGTCF                          (1 << 7)
#define USART_ICR_LBDCF                            (1 << 8)
#define USART_ICR_CTSCF                            (1 << 9)
#define USART_ICR_RTOCF                            (1 << 11)
#define USART_ICR_EOBCF                            (1 << 12)
#define USART_ICR_UDRCF                            (1 << 13)
#define USART_ICR_CMCF                             (1 << 17)
#define USART_ICR_NCF                              USART_ICR_NECF

/* USART receive-data register */

#define USART_RDR_RDR_SHIFT                        (0)
#define USART_RDR_RDR_MASK                         (0x1ff << USART_RDR_RDR_SHIFT)
#define USART_RDR_RDR(n)                           ((n) << USART_RDR_RDR_SHIFT)
#define USART_RDR_SHIFT                            USART_RDR_RDR_SHIFT
#define USART_RDR_MASK                             USART_RDR_RDR_MASK

/* USART transmit-data register */

#define USART_TDR_TDR_SHIFT                        (0)
#define USART_TDR_TDR_MASK                         (0x1ff << USART_TDR_TDR_SHIFT)
#define USART_TDR_TDR(n)                           ((n) << USART_TDR_TDR_SHIFT)
#define USART_TDR_SHIFT                            USART_TDR_TDR_SHIFT
#define USART_TDR_MASK                             USART_TDR_TDR_MASK

/* USART prescaler register */

