apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_uart_m33_u3u5.h
#define USART_PRESC_PRESCALER_SHIFT                (0)
#define USART_PRESC_PRESCALER_MASK                 (0xf << USART_PRESC_PRESCALER_SHIFT)
#define USART_PRESC_PRESCALER(n)                   ((n) << USART_PRESC_PRESCALER_SHIFT)
#define USART_PRESC_DIV1                           USART_PRESC_PRESCALER(0)
#define USART_PRESC_DIV2                           USART_PRESC_PRESCALER(1)
#define USART_PRESC_DIV4                           USART_PRESC_PRESCALER(2)
#define USART_PRESC_DIV6                           USART_PRESC_PRESCALER(3)
#define USART_PRESC_DIV8                           USART_PRESC_PRESCALER(4)
#define USART_PRESC_DIV10                          USART_PRESC_PRESCALER(5)
#define USART_PRESC_DIV12                          USART_PRESC_PRESCALER(6)
#define USART_PRESC_DIV16                          USART_PRESC_PRESCALER(7)
#define USART_PRESC_DIV32                          USART_PRESC_PRESCALER(8)
#define USART_PRESC_DIV64                          USART_PRESC_PRESCALER(9)
#define USART_PRESC_DIV128                         USART_PRESC_PRESCALER(10)
#define USART_PRESC_DIV256                         USART_PRESC_PRESCALER(11)

/* USART autonomous-mode control register */

#define USART_AUTOCR_TDN_SHIFT                     (0)
#define USART_AUTOCR_TDN_MASK                      (0xffff << USART_AUTOCR_TDN_SHIFT)
#define USART_AUTOCR_TDN(n)                        ((n) << USART_AUTOCR_TDN_SHIFT)
#define USART_AUTOCR_TRIGPOL                       (1 << 16)
#define USART_AUTOCR_TRIGEN                        (1 << 17)
#define USART_AUTOCR_IDLEDIS                       (1 << 18)
#define USART_AUTOCR_TRIGSEL_SHIFT                 (19)
#define USART_AUTOCR_TRIGSEL_MASK                  (0xf << USART_AUTOCR_TRIGSEL_SHIFT)
#define USART_AUTOCR_TRIGSEL(n)                    ((n) << USART_AUTOCR_TRIGSEL_SHIFT)

#endif /* __ARCH_ARM_SRC_COMMON_STM32_HARDWARE_STM32_UART_M33_U3U5_H */
